import { Texts } from "../types";

const dataRu: Texts = {
    home: 'Главная',
    signIn: 'Войти',
    signUp: 'Зарегистрироваться',
    graphiql: 'График',
    exit: 'Выход',
    titleProject: 'О Проекте',
    textProject: 'GraphiQL — это игровая площадка/IDE для запросов GraphiQL. Это приложение содержит набор строительных блоков, которые позволяют пользователям с легкостью создавать IDE GraphQL.',
    titleAboutUs: 'О Нас',
    textPerson1: 'Меня зовут Валерий. Я начал изучать программирование в прошлом году. Сначала я изучал фронтенд на разных платформах и это было несистематически, но потом нашел RS School. Я начал учиться со stage 0 и сейчас заканчиваю курс React. Моя цель — стать фронтенд-разработчиком.',
    textPerson2: 'Меня зовут Валерий. Я начал изучать программирование в прошлом году. Сначала я изучал фронтенд на разных платформах и это было несистематически, но потом нашел RS School. Я начал учиться со stage 0 и сейчас заканчиваю курс React. Моя цель — стать фронтенд-разработчиком.',
    textPerson3: 'Меня зовут Валерий. Я начал изучать программирование в прошлом году. Сначала я изучал фронтенд на разных платформах и это было несистематически, но потом нашел RS School. Я начал учиться со stage 0 и сейчас заканчиваю курс React. Моя цель — стать фронтенд-разработчиком.',
    titleAboutCourse: 'О Курсе',
};

export default dataRu;