import { Texts } from '../types';

const dataRu: Texts = {
  header: {
    home: 'Главная',
    signIn: 'Войти',
    signUp: 'Зарегистрироваться',
    graphiql: 'График',
    exit: 'Выход',
  },
  welcomePage: {
    titleProject: 'О Проекте',
    subtitleAboutProject:
      'Добро пожаловать в GraphQL Editor – ваш универсальный инструмент для создания и тестирования GraphQL запросов в реальном времени!',
    descriptionAboutProject:
      ' Наш онлайн редактор предоставляет удобный интерфейс для взаимодействия с любым GraphQL API. Просто введите ссылку на целевой API, и вы окажетесь в виртуальной среде, где сможете свободно экспериментировать с вашими запросами.',
    keyFuturesProject: [
      {
        title: '<b>Интерактивный Редактор Кода</b>',
        text: 'Используйте наш мощный редактор кода для написания и редактирования GraphQL запросов. Получайте мгновенные подсказки и автозаполнение, чтобы ускорить процесс написания кода.',
      },
      {
        title: '<b>Тестирование в Реальном Времени</b>',
        text: 'Просматривайте результаты запросов непосредственно в редакторе, мгновенно видя, какие данные возвращает API. Это обеспечивает эффективную разработку и отладку ваших запросов.',
      },
      {
        title: '<b>API Документация в Одном Месте</b>',
        text: 'Получайте доступ к справочной информации о вашем API прямо в редакторе. Вы можете изучать схемы вашего API прямо в редакторе!',
      },
      {
        title: '<b>Безопасность и Удобство</b>',
        text: 'Мы гарантируем конфиденциальность ваших данных и предоставляем интуитивный интерфейс для максимального комфорта при работе.',
      },
    ],
    endingAboutProject:
      '</b>GraphQL Editor</b> – ваш надежный партнер для эффективного взаимодействия с GraphQL API. Упростите процесс создания запросов, экономьте время и улучшайте качество вашей разработки – присоединяйтесь прямо сейчас!',
    titleAboutUs: 'О Нас',
    textPerson1:
      'Меня зовут Валерий. Я начал изучать программирование в прошлом году. Сначала я изучал фронтенд на разных платформах и это было несистематически, но потом нашел RS School. Я начал учиться со stage 0 и сейчас заканчиваю курс React. Моя цель — стать фронтенд-разработчиком.',
    textPerson2:
      'Меня зовут Валерий. Я начал изучать программирование в прошлом году. Сначала я изучал фронтенд на разных платформах и это было несистематически, но потом нашел RS School. Я начал учиться со stage 0 и сейчас заканчиваю курс React. Моя цель — стать фронтенд-разработчиком.',
    textPerson3:
      'Меня зовут Валерий. Я начал изучать программирование в прошлом году. Сначала я изучал фронтенд на разных платформах и это было несистематически, но потом нашел RS School. Я начал учиться со stage 0 и сейчас заканчиваю курс React. Моя цель — стать фронтенд-разработчиком.',
    titleAboutCourse: 'О Курсе',
  },
};

export default dataRu;
